package com.example.ljh.vr.data;

import java.util.ArrayList;
import java.util.List;

public class City {
    public final static String citys[] = {"A","阿拉善市","鞍山市","澳门", "安庆市","阿克苏市","阿勒泰市",
            "安阳市","恩施市","阿坝市","安顺市","阿里市","安康市",
            "B","百色市", "巴中市","毕节市", "保山市","宝鸡市","白银市","滨州市","亳州市","巴音郭楞蒙古市",
            "博尔塔拉蒙古市","蚌埠市", "北京市","保定市","包头市","巴彦淖尔市" ,"本溪市", "白山市","白城市",
            "C","承德市" ,"沧州市","长治市","赤峰市" ,"朝阳市","长春市","常州市","泉州市","池州市","昌吉市",
            "滁州市","巢湖市","长沙市","常德市","郴州市","潮州市","崇左市", "重庆","成都市","楚雄市","昌都市"
            ,"D","德阳市","达州市","大理市","德宏市","迪庆市","定西市","东营市","德州市","东莞市",
            "大庆市","大兴安岭市","大同市" , "大连市", "丹东市",
            "E","鄂尔多斯市","鄂州市",
            "F","防城港市","佛山市","福州市","阜阳市","抚顺市", "阜新市",
            "G","黄南市","果洛市", "固原市" ,"高雄市","赣州市","广州市","桂林市","贵港市", "广元市",
            "广安市","甘孜市","贵阳市","甘南市",
            "H","邯郸市", "衡水市", "呼和浩特市", "呼伦贝尔市", "葫芦岛市", "海东市", "海北市", "黄南市",
            "海南市", "海西市","哈尔滨市","鹤岗市","黑河市", "淮安市","杭州市","湖州市","合肥市","淮南市",
            "淮北市","黄山市","龙岩市","哈密市","和田市","菏泽市","鹤壁市","黄石市","黄冈市","衡阳市",
            "怀化市", "惠州市","河源市","贺州市","河池市","海口市", "红河市","汉中市",
            "J","晋城市","晋中市" ,"锦州市" , "吉林市","基隆市","嘉义市","鸡西市", "佳木斯市","嘉兴市",
            "金华市","景德镇市","九江市","吉安市","济南市","济宁市","焦作市","荆州市","荆门市","江门市",
            "揭阳市","嘉峪关市","金昌市","酒泉市",
            "K","昆明市","开封市","克拉玛依市","喀什市","克孜勒苏柯尔克孜市",
            "L","廊坊市" ,"临汾市", "吕梁市" ,"辽阳市", "辽源市","连云港市","宁波市","丽水市", "莱芜市",
            "临沂市","聊城市","洛阳市","漯河市","柳州市","来宾市", "泸州市","乐山市","凉山市","六盘水市",
            "丽江市","临沧市","拉萨市","兰州市","林芝市","陇南市","临夏市",
            "M","牡丹江市","马鞍山市","茂名市","梅州市","绵阳市","眉山市",
            "N","南京市", "南通市","南平市","南昌市","南阳市","南宁市","内江市","南充市","怒江市","那曲市",
            "P","盘锦市", "莆田市","萍乡市","平顶山市","攀枝花市","普洱市","平凉市",
            "Q","秦皇岛市", "忻州市","齐齐哈尔市","七台河市","衢州市","青岛市","清远市","钦州市", "黔西南市",
            "黔东南市","黔南市","曲靖市","庆阳市",
            "R","日喀则市",
            "S","石家庄市"," 朔州市"," 沈阳市" ,"四平市","松原市","石嘴山市","双鸭山市","上海市", "苏州市",
            "宿迁市","宿州市","三明市","绥化市","上饶市","三门峡市","商丘市","十堰市","深圳市","汕头市",
            "韶关市", "汕尾市","三亚市","遂宁市","昭通市","山南市","商洛市",
            "T","天津市", "唐山市" ,"太原市", "通辽市", "铁岭市","通化市", "台北市","台中市","台南市",
            "泰州市","台州市","铜陵市","吐鲁番市","塔城市","泰安市","铜仁市","铜川市","天水市",
            "W","乌海市", "乌兰察布市","吴忠市","无锡市","温州市","乌鲁木齐市","芜湖市","抚州市","潍坊市",
            "威海市","武汉市","梧州市","文山市","渭南市",
            "X","邢台市", "兴安市", "锡林郭勒市" ,"西宁市", "香港","新竹市","徐州市","厦门市","宣城市",
            "新余市","新乡市","许昌市","信阳市","襄樊市","孝感市","咸宁市","随州市","湘潭市","永州市","湘西市",
            "西双版纳市","西安市","咸阳市",
            "Y","阳泉市" ,"运城市", "营口市","延边市", "玉树市","银川市","伊春市","盐城市","扬州市",
            "伊犁哈萨克市","鹰潭市","宜春市","烟台市","濮阳市","宜昌市","岳阳市","益阳市","阳江市","云浮市",
            "玉林市", "宜宾市","雅安市","玉溪市","延安市","榆林市",
            "Z","张家口市", "中卫市","镇江市","绍兴市","舟山市","漳州市","淄博市","枣庄市","郑州市","周口市",
            "驻马店市","株洲市","邵阳市","张家界市","珠海市","湛江市","肇庆市","中山市","自贡市",
            "资阳市", "遵义市", "张掖市"};

    public static List<String> cityList = new ArrayList<>();
    public static void addCity(){
        for(int i=0;i<citys.length;i++){
            cityList.add(citys[i]);
        }
    }
}
