package com.example.ljh.vr.data;

public class City {
    public static String citys[] = {"石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市",
            "承德市","沧州市","廊坊市","衡水市"};
//    mSecondDatas.put("北京市",new String[]{"北京"});
//        mSecondDatas.put("天津市",new String[]{"天津"});
//        mSecondDatas.put("河北省",new String[]{"石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市"});
//        mSecondDatas.put("山西省",new String[]{"太原市","大同市","阳泉市","长治市","晋城市","朔州市","晋中市","运城市","忻州市","临汾市","吕梁市"});
//        mSecondDatas.put("内蒙古省",new String[]{"呼和浩特市","包头市","乌海市","赤峰市","通辽市","鄂尔多斯市","呼伦贝尔市","巴彦淖尔市","乌兰察布市","兴安市","锡林郭勒市","阿拉善市"});
//        mSecondDatas.put("辽宁省",new String[]{"沈阳市","大连市","鞍山市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","盘锦市","铁岭市","朝阳市","葫芦岛市"});
//        mSecondDatas.put("吉林省",new String[]{"长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边市"});
//        mSecondDatas.put("黑龙江省",new String[]{"哈尔滨市","齐齐哈尔市","鸡西市","鹤岗市","双鸭山市","大庆市","伊春市","佳木斯市","七台河市","牡丹江市","黑河市","绥化市","大兴安岭市"});
//        mSecondDatas.put("上海市",new String[]{"上海"});
//        mSecondDatas.put("江苏省",new String[]{"南京市","无锡市","徐州市","常州市","苏州市","南通市","连云港市","淮安市","盐城市","扬州市","镇江市","泰州市","宿迁市"});
//        mSecondDatas.put("浙江省",new String[]{"杭州市","宁波市","温州市","嘉兴市","湖州市","绍兴市","金华市","衢州市","舟山市","台州市","丽水市"});
//        mSecondDatas.put("安徽省",new String[]{"合肥市","芜湖市","蚌埠市","淮南市","马鞍山市","淮北市","铜陵市","安庆市","黄山市","滁州市","阜阳市","宿州市","巢湖市","六安市","亳州市","池州市","宣城市"});
//        mSecondDatas.put("福建省",new String[]{"福州市","厦门市","莆田市","三明市","泉州市","漳州市","南平市","龙岩市","宁德市"});
//        mSecondDatas.put("江西省",new String[]{"南昌市","景德镇市","萍乡市","九江市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市"});
//        mSecondDatas.put("山东省",new String[]{"济南市","青岛市","淄博市","枣庄市","东营市","烟台市","潍坊市","威海市","济宁市","泰安市","日照市","莱芜市","临沂市","德州市","聊城市","滨州市","菏泽市"});
//        mSecondDatas.put("河南省",new String[]{"郑州市","开封市","洛阳市","平顶山市","焦作市","鹤壁市","新乡市","安阳市","濮阳市","许昌市","漯河市","三门峡市","南阳市","商丘市","信阳市","周口市","驻马店市"});
//        mSecondDatas.put("湖北省",new String[]{"武汉市","黄石市","襄樊市","十堰市","荆州市","宜昌市","荆门市","鄂州市","孝感市","黄冈市","咸宁市","随州市","恩施市"});
//        mSecondDatas.put("湖南省",new String[]{"长沙市","株洲市","湘潭市","衡阳市","邵阳市","岳阳市","常德市","张家界市","益阳市","郴州市","永州市","怀化市","娄底市","湘西市"});
//        mSecondDatas.put("广东省",new String[]{"广州市","深圳市","珠海市","汕头市","韶关市","佛山市","江门市","湛江市","茂名市","肇庆市","惠州市","梅州市","汕尾市","河源市","阳江市","清远市","东莞市","中山市","潮州市","揭阳市","云浮市"});
//        mSecondDatas.put("广西自治区",new String[]{"南宁市","柳州市","桂林市","梧州市","北海市","防城港市","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市"});
//        mSecondDatas.put("海南省",new String[]{"海口市","三亚市"});
//        mSecondDatas.put("重庆市",new String[]{"重庆"});
//        mSecondDatas.put("四川省",new String[]{"成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","宜宾市","广安市","达州市","眉山市","雅安市","巴中市","资阳市","阿坝市","甘孜市","凉山市"});
//        mSecondDatas.put("贵州省",new String[]{"贵阳市","六盘水市","遵义市","安顺市","铜仁市","毕节市","黔西南市","黔东南市","黔南市"});
//        mSecondDatas.put("云南省",new String[]{"昆明市","曲靖市","玉溪市","保山市","昭通市","丽江市","普洱市","临沧市","文山市","红河市","西双版纳市","楚雄市","大理市","德宏市","怒江市","迪庆市"});
//        mSecondDatas.put("西藏自治区",new String[]{"拉萨市","昌都市","山南市","日喀则市","那曲市","阿里市","林芝市"});
//        mSecondDatas.put("陕西省",new String[]{"西安市","铜川市","宝鸡市","咸阳市","渭南市","延安市","汉中市","榆林市","安康市","商洛市"});
//        mSecondDatas.put("甘肃省",new String[]{"兰州市","嘉峪关市","金昌市","白银市","天水市","武威市","张掖市","平凉市","酒泉市","庆阳市","定西市","陇南市","临夏市","甘南市"});
//        mSecondDatas.put("青海省",new String[]{"西宁市","海东市","海北市","黄南市","海南市","果洛市","玉树市","海西市"});
//        mSecondDatas.put("宁夏回族自治区",new String[]{"银川市","石嘴山市","吴忠市","固原市","中卫市"});
//        mSecondDatas.put("新疆维吾尔自治区",new String[]{"乌鲁木齐市","克拉玛依市","吐鲁番市","哈密市","和田市","阿克苏市","喀什市","克孜勒苏柯尔克孜市","巴音郭楞蒙古市","昌吉市","博尔塔拉蒙古市","伊犁哈萨克市","塔城市","阿勒泰市"});
//        mSecondDatas.put("香港特别行政区",new String[]{"香港"});
//        mSecondDatas.put("澳门特别行政区",new String[]{"澳门"});
//        mSecondDatas.put("台湾省",new String[]{"台北市","高雄市","基隆市","台中市","台南市","新竹市","嘉义市"});
//        mSecondDatas.put("其他",new String[]{"其他市"});
}
